"app.name" = "Arca";
"locked.title.create" = "Create a new encrypted vault";
"locked.title.unlock" = "Unlock your vault";
"locked.master_password" = "Master password";
"locked.confirm_password" = "Confirm password";
"locked.action.create" = "Create Vault";
"locked.action.unlock" = "Unlock";
"locked.loading" = "Unlocking…";
"locked.error.passwords_mismatch" = "Passwords do not match.";
"locked.auth_mode.title" = "Choose how this vault will be unlocked";
"locked.auth_mode.master.title" = "Use a master password";
"locked.auth_mode.master.message" = "Create and keep using a password that Arca will ask for whenever the vault is unlocked.";
"locked.auth_mode.device.title" = "Use macOS authentication";
"locked.auth_mode.device.message" = "Unlock with the standard macOS authentication dialog, using Touch ID, Apple Watch, or your Mac password on this Mac.";
"locked.auth_mode.mutable" = "Choose the first unlock method now. You can add or remove unlock methods later in Settings.";
"locked.master_password_hint" = "This vault uses a master password for unlocking.";
"locked.action.device_auth" = "Unlock with macOS Authentication";
"locked.device_auth_hint" = "macOS authentication is ready to be configured for this vault on this Mac.";
"locked.device_auth_ready_hint" = "This vault is configured to unlock with standard macOS authentication on this Mac.";
"locked.device_auth_bundle_hint" = "macOS authentication requires running Arca as a signed .app bundle. Launching via swift run may not allow protected Keychain storage.";
"locked.device_auth_unavailable_hint" = "Standard macOS authentication is not currently available for Arca on this Mac.";
"locked.multiple_auth_hint" = "This vault supports both a master password and standard macOS authentication.";
"locked.multiple_auth_master_only_hint" = "This vault supports multiple unlock methods, but standard macOS authentication isn't currently available on this Mac.";
"locked.no_auth_methods_hint" = "No unlock method is currently configured for this vault.";
"locked.action.biometric" = "Unlock with Biometrics";
"locked.action.touch_id" = "Unlock with Touch ID";
"locked.action.face_id" = "Unlock with Face ID";
"locked.action.optic_id" = "Unlock with Optic ID";
"locked.vault_path" = "Vault path";
"locked.biometric_hint" = "Biometric unlock becomes available on Macs that support it after a successful master password unlock.";
"locked.biometric_ready_hint" = "Biometric unlock is ready on this Mac.";
"locked.biometric_bundle_hint" = "Biometric unlock requires running Arca as a signed .app bundle. Launching via swift run may not allow protected Keychain storage.";
"locked.biometric_unavailable_hint" = "This Mac does not currently offer a supported biometric unlock path for Arca.";
"sidebar.location" = "Location";
"location.icloud" = "iCloud";
"toolbar.new_note" = "New Secure Note";
"toolbar.refresh" = "Refresh";
"toolbar.delete" = "Delete";
"toolbar.lock" = "Lock";
"toolbar.search" = "Search";
"delete.confirm.title" = "Delete this note?";
"delete.confirm.action" = "Delete";
"common.cancel" = "Cancel";
"common.ok" = "OK";
"common.done" = "Done";
"delete.confirm.message" = "This note will be deleted and hidden from your synced vault: '%@'.";
"note.kind.secure" = "Secure Note";
"note.kind.label" = "Kind: Secure Note";
"note.modified.label" = "Modified: %@";
"note.name.placeholder" = "Name";
"table.header.name" = "Name";
"table.header.kind" = "Kind";
"table.header.date_modified" = "Date Modified";
"table.header.location" = "Location";
"contents.title" = "Contents";
"contents.empty" = "No Contents";
"tab.all_items" = "All Items";
"tab.secure_notes" = "Secure Notes";
"note.title.untitled" = "Untitled";
"location.local_vault" = "Local Storage";
"refresh.notice" = "%@ has been refreshed.";
"unlock.prompt" = "Unlock Arca";
"menu.save" = "Save";
"menu.about" = "About %@";
"save.confirm.title" = "Save changes to this note?";
"save.confirm.message" = "Your edits have not been saved yet.";
"save.confirm.save" = "Save";
"save.confirm.discard" = "Discard Changes";
"sidebar.settings" = "Settings";
"settings.title" = "Settings";
"settings.placeholder" = "This is a UI placeholder for future location management behavior.";
"settings.empty_title" = "No Location Selected";
"settings.empty_message" = "Select a location on the left or create a new one.";
"settings.location.name" = "Location Name";
"settings.location.path" = "Vault Path";
"settings.location.sync" = "Use iCloud sync";
"settings.location.default" = "Preferred location";
"settings.location.new_name" = "New Location";
"settings.auth.title" = "Unlock Methods";
"settings.auth.title_short" = "Authentication";
"settings.auth.enabled" = "Enabled";
"settings.auth.disabled" = "Disabled";
"settings.auth.helper" = "You can keep both unlock methods enabled at the same time, but at least one method must remain enabled.";
"settings.auth.master.title" = "Master Password";
"settings.auth.master.new_password" = "New master password";
"settings.auth.master.confirm_password" = "Confirm master password";
"settings.auth.master.enable" = "Enable Master Password";
"settings.auth.master.disable" = "Disable Master Password";
"settings.auth.master.enabled" = "Master password unlock is now enabled.";
"settings.auth.master.disabled" = "Master password unlock has been disabled.";
"settings.auth.device.title" = "macOS Authentication";
"settings.auth.device.enable" = "Enable macOS Authentication";
"settings.auth.device.disable" = "Disable macOS Authentication";
"settings.auth.device.enabled" = "Standard macOS authentication is now enabled.";
"settings.auth.device.disabled" = "Standard macOS authentication has been disabled.";
"error.init_vault" = "Failed to initialize vault: %@";
"error.crypto.invalid_base64" = "Encrypted file contains invalid base64 data.";
"error.crypto.invalid_envelope" = "Encrypted file is malformed.";
"error.crypto.password_incorrect" = "Master password is incorrect.";
"error.crypto.missing_master_password" = "This vault doesn't currently have a master password configured.";
"error.crypto.unsupported_suite" = "Unsupported encryption suite: %@.";
"error.file_format.unsupported_version" = "Unsupported %@ format version %d. This build supports up to version %d.";
"error.notestore.missing_metadata" = "Vault metadata is missing.";
"error.notestore.missing_auth_method" = "At least one unlock method must remain enabled.";
"warning.skipped_malformed" = "Skipped malformed note file: %@";
"warning.skipped_note_file" = "Skipped unreadable or unsupported note file: %@";
"file_format.kind.note" = "note file";
"file_format.kind.tombstone" = "tombstone";
"file_format.kind.vault_metadata" = "vault metadata";
"warning.conflict_preserved" = "Preserved conflict copy for '%@'.";
"warning.conflict_normalize_failed" = "Failed to normalize conflict copy: %@";
"suffix.conflicted_copy" = "(Conflicted Copy)";
"error.biometric.unavailable" = "Biometric unlock is unavailable in this build of Arca.";
"error.biometric.missing" = "No saved biometric unlock credential is available yet. Unlock once with your master password first.";
"error.biometric.invalid" = "Stored biometric unlock credential is invalid.";
"error.biometric.status" = "Keychain request failed with status %d.";
"error.device_auth.unavailable" = "Standard macOS authentication is unavailable in this build of Arca.";
"error.device_auth.missing_entitlement" = "Standard macOS authentication is not configured correctly for this app build. Check the app signing configuration and run the signed .app again.";
"error.device_auth.missing" = "No saved macOS authentication credential is available for this vault on this Mac.";
"error.device_auth.invalid" = "Stored macOS authentication credential is invalid.";
"error.device_auth.status" = "Keychain request failed with status %d.";
"about.tagline" = "Secure storage for sensitive notes.";
"about.version" = "Arca version %@";
"about.license" = "MIT License";
"about.repository" = "SigFoundry/Arca";
